{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          4
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "<unk>",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 1000,
    "vocab": {
      "<bos>": 0,
      "<cls>": 1,
      "<pad>": 2,
      "<sep>": 3,
      "<eos>": 4,
      "<unk>": 5,
      "<mask>": 6,
      "[:=1chiral]": 7,
      "[:1ammonium]": 8,
      "[=I]": 9,
      "[:=2tetrahydrofuran]": 10,
      "[:1cyclopentane]": 11,
      "[:0phosphine6]": 12,
      "[\\C]": 13,
      "[:=1sulfilimine_cis]": 14,
      "[N]": 15,
      "[:=1dithiole]": 16,
      "[:#2sulfonium]": 17,
      "[:=0piperidine]": 18,
      "[:1bridged_n]": 19,
      "[:#1pyrazine]": 20,
      "[:=1phosphine7]": 21,
      "[:0benzene]": 22,
      "[I]": 23,
      "[:#4cyclohexane]": 24,
      "[:#0ammonium]": 25,
      "[:#1thiophene]": 26,
      "[:#1oxadiazole]": 27,
      "[#Cl]": 28,
      "[:1sulfoxime_cis]": 29,
      "[:=2cyclopropane]": 30,
      "[O]": 31,
      "[:#1tetrazine]": 32,
      "[:0pyrazole]": 33,
      "[:3chiral2]": 34,
      "[#Ring1]": 35,
      "[:0diazinane]": 36,
      "[=Ring1]": 37,
      "[:#1tetrahydrofuran]": 38,
      "[:#1imidazoline]": 39,
      "[:=1sulfoxime_trans]": 40,
      "[:=0boron]": 41,
      "[:#0sulfan_general]": 42,
      "[\\Ring1]": 43,
      "[:1cyclopropane]": 44,
      "[pop]": 45,
      "[:#0triazole1]": 46,
      "[:#3cyclopentane]": 47,
      "[:3cyclohexane]": 48,
      "[:#0chiralc13]": 49,
      "[:#0chiral]": 50,
      "[:=2pyrazine]": 51,
      "[:=3chiral2]": 52,
      "[:=1diazinane]": 53,
      "[:#0sulfoxime_trans]": 54,
      "[:2chiral2c13]": 55,
      "[:0carboxylate]": 56,
      "[:2sulfox_general]": 57,
      "[:=0pyrazine]": 58,
      "[:=2ammonium2]": 59,
      "[:#2boron]": 60,
      "[:0thiophene]": 61,
      "[:=0diazinane]": 62,
      "[:#1piperidine]": 63,
      "[:0chiralc13]": 64,
      "[:0phosphine2]": 65,
      "[:1benzene]": 66,
      "[:3pyrazine]": 67,
      "[:=1phosphine2]": 68,
      "[:#4cyclopentane]": 69,
      "[:=3cyclohexane]": 70,
      "[:=0sulfilimine_cis]": 71,
      "[:2sulfonium]": 72,
      "[:=1sulfoxime_cis]": 73,
      "[/N]": 74,
      "[:0phosphine4]": 75,
      "[#Branch]": 76,
      "[:2cyclopentane]": 77,
      "[:1sulfan_general]": 78,
      "[:#2sulfan_general]": 79,
      "[:5cyclohexane]": 80,
      "[:#1diazinane]": 81,
      "[:4cyclohexane]": 82,
      "[:=2aziridine_n]": 83,
      "[=Ring3]": 84,
      "[:#0diazinane]": 85,
      "[:=0chiral2]": 86,
      "[:0sulfan_general]": 87,
      "[:0pyrazine]": 88,
      "[:#0oxadiazole]": 89,
      "[:2sulfan_general]": 90,
      "[:=2cyclobutane]": 91,
      "[:#2chiral2]": 92,
      "[:=3phosphine7]": 93,
      "[:#0phosphine6]": 94,
      "[:#2sulfoxime_cis]": 95,
      "[:=1boron]": 96,
      "[:0triazinane]": 97,
      "[:#1phosphine7]": 98,
      "[:=1cyclobutane]": 99,
      "[C]": 100,
      "[:#1cyclopentane]": 101,
      "[:=0cyclopentadiene]": 102,
      "[:=2phosphine5]": 103,
      "[:=1cyclopentadiene]": 104,
      "[:0phosphine3]": 105,
      "[:1imidazoline]": 106,
      "[:#2benzene]": 107,
      "[:3pyrrolidine]": 108,
      "[:0cyclohexane]": 109,
      "[:=1benzene]": 110,
      "[:=2phosphine2]": 111,
      "[:2triazinane]": 112,
      "[:0phosphine5]": 113,
      "[=O]": 114,
      "[:#2pyrrolidine]": 115,
      "[:#2cyclopentane]": 116,
      "[:1pyrrolidine]": 117,
      "[:2chiral2]": 118,
      "[:1piperidine]": 119,
      "[:#2ammonium2]": 120,
      "[\\Br]": 121,
      "[:#0chiral2c13]": 122,
      "[:2bridged_n]": 123,
      "[\\B]": 124,
      "[:=0triazinane]": 125,
      "[:#2cyclopropane]": 126,
      "[:#1furan]": 127,
      "[:=0sulfilimine_trans]": 128,
      "[#F]": 129,
      "[:=0cyclobutane]": 130,
      "[:=0cyclopentane]": 131,
      "[:=1pyrimidine]": 132,
      "[:2phosphine2]": 133,
      "[:0pyrrole]": 134,
      "[/F]": 135,
      "[:0sulfilimine_trans]": 136,
      "[#B]": 137,
      "[:2sulfoxime_cis]": 138,
      "[:3chiral2c13]": 139,
      "[:=0sulfoxime_trans]": 140,
      "[:=0ammonium]": 141,
      "[:2ammonium2]": 142,
      "[:2cyclohexane]": 143,
      "[:=2chiral2c13]": 144,
      "[:2pyrazine]": 145,
      "[:#2triazinane]": 146,
      "[:=0phosphine3]": 147,
      "[:=0sulfox_general]": 148,
      "[:#2bridged_n]": 149,
      "[:#1boron]": 150,
      "[#N]": 151,
      "[:2sulfilimine_trans]": 152,
      "[:#0cyclobutane]": 153,
      "[:3benzene]": 154,
      "[:2phosphine6]": 155,
      "[:0tetrazine]": 156,
      "[:#0tetrazine]": 157,
      "[:#1cyclobutane]": 158,
      "[:#3phosphine7]": 159,
      "[:#1phosphine5]": 160,
      "[:2phosphine5]": 161,
      "[:0imidazoline]": 162,
      "[#Br]": 163,
      "[:=0phosphine]": 164,
      "[:#0phosphine2]": 165,
      "[:=3pyrazine]": 166,
      "[:0bridged_n]": 167,
      "[:=2sulfonium]": 168,
      "[:#0ammonium2]": 169,
      "[:3cyclopentane]": 170,
      "[:#4pyrrolidine]": 171,
      "[:0sulfonium]": 172,
      "[Br]": 173,
      "[:=2phosphine6]": 174,
      "[:#4benzene]": 175,
      "[:=1tetrahydrofuran]": 176,
      "[:1pyrazole]": 177,
      "[:#0pyrimidine]": 178,
      "[:=3cyclopentane]": 179,
      "[:0cyclopentadiene]": 180,
      "[Cl]": 181,
      "[\\Ring2]": 182,
      "[:=1pyrrolidine]": 183,
      "[:#1cyclopropane]": 184,
      "[:1thiophene]": 185,
      "[:=0tetrazole]": 186,
      "[:#0chiral2]": 187,
      "[:#0phosphine4]": 188,
      "[\\S]": 189,
      "[:1phosphine3]": 190,
      "[/O]": 191,
      "[:=3cyclobutane]": 192,
      "[:0dithiole]": 193,
      "[/B]": 194,
      "[:=2sulfilimine_cis]": 195,
      "[:=0dithiole]": 196,
      "[:=1sulfilimine_trans]": 197,
      "[:#0imidazoline]": 198,
      "[:#2phosphine5]": 199,
      "[:=4pyrrolidine]": 200,
      "[:0chiral]": 201,
      "[:#3ammonium]": 202,
      "[Ring1]": 203,
      "[:5benzene]": 204,
      "[:0tetrazole]": 205,
      "[:1phosphine2]": 206,
      "[:#3pyrazole]": 207,
      "[:#2ammonium]": 208,
      "[:2sulfilimine_cis]": 209,
      "[:=1piperidine]": 210,
      "[:=1phosphine4]": 211,
      "[:0sulfox_general]": 212,
      "[:#3pyrrolidine]": 213,
      "[:2pyrazole]": 214,
      "[:=0phosphine4]": 215,
      "[:=3pyrazole]": 216,
      "[:=0triazole1]": 217,
      "[:#1chiral2c13]": 218,
      "[:=1imidazoline]": 219,
      "[:=0tetrahydrofuran]": 220,
      "[:2benzene]": 221,
      "[:#3boron]": 222,
      "[:#3tetrahydrofuran]": 223,
      "[:#1phosphine2]": 224,
      "[:=2triazinane]": 225,
      "[:=1pyrrole]": 226,
      "[:0furan]": 227,
      "[:=3pyrrolidine]": 228,
      "[:=1cyclohexane]": 229,
      "[:#0sulfoxime_cis]": 230,
      "[:#3cyclohexane]": 231,
      "[:1tetrazine]": 232,
      "[:2ammonium]": 233,
      "[=Ring2]": 234,
      "[:0chiral2]": 235,
      "[:=1chiral2]": 236,
      "[:=3tetrahydrofuran]": 237,
      "[:1triazole1]": 238,
      "[:#0tetrahydrofuran]": 239,
      "[:=0sulfonium]": 240,
      "[:=0ammonium2]": 241,
      "[#C]": 242,
      "[:=2bridged_n]": 243,
      "[:#2chiralc13]": 244,
      "[:1pyrazine]": 245,
      "[:#1pyrazole]": 246,
      "[:#2pyrazole]": 247,
      "[:=0sulfoxime_cis]": 248,
      "[:#2sulfoxime_trans]": 249,
      "[\\O]": 250,
      "[:#1sulfonium]": 251,
      "[:=0sulfan_general]": 252,
      "[:#5cyclohexane]": 253,
      "[:=1triazinane]": 254,
      "[#P]": 255,
      "[:#1phosphine]": 256,
      "[:=2pyrrolidine]": 257,
      "[:=5benzene]": 258,
      "[:#1cyclopentadiene]": 259,
      "[:1triazinane]": 260,
      "[:1cyclohexane]": 261,
      "[:#0cyclopentane]": 262,
      "[:#2cyclobutane]": 263,
      "[:#1chiral]": 264,
      "[:1sulfilimine_trans]": 265,
      "[:=1cyclopropane]": 266,
      "[:#2chiral]": 267,
      "[:=0cyclopropane]": 268,
      "[=C]": 269,
      "[:1oxadiazole]": 270,
      "[\\Cl]": 271,
      "[:1chiral2c13]": 272,
      "[/I]": 273,
      "[:#3benzene]": 274,
      "[:=0carboxylate]": 275,
      "[:#0phosphine3]": 276,
      "[:=0phosphineoxide]": 277,
      "[:=1tetrazine]": 278,
      "[:=2benzene]": 279,
      "[:0cyclopropane]": 280,
      "[:0phosphine]": 281,
      "[:=2sulfoxime_cis]": 282,
      "[/Ring1]": 283,
      "[:#0cyclopentadiene]": 284,
      "[:=1tetrazole]": 285,
      "[:#1tetrazole]": 286,
      "[:#0sulfilimine_trans]": 287,
      "[:#0boron]": 288,
      "[:=2chiral2]": 289,
      "[:#1phosphine6]": 290,
      "[:=0aziridine_n]": 291,
      "[:=3ammonium]": 292,
      "[:2chiralc13]": 293,
      "[:=1bridged_n]": 294,
      "[\\Ring3]": 295,
      "[:#0phosphine]": 296,
      "[:#2pyrazine]": 297,
      "[:#1sulfilimine_cis]": 298,
      "[:1phosphine7]": 299,
      "[:#0bridged_n]": 300,
      "[:=0phosphine2]": 301,
      "[:#0phosphineoxide]": 302,
      "[:1chiral2]": 303,
      "[:#0benzene]": 304,
      "[:#3pyrazine]": 305,
      "[#Ring2]": 306,
      "[:#1ammonium]": 307,
      "[S]": 308,
      "[:0phosphine7]": 309,
      "[:#2sulfilimine_trans]": 310,
      "[:=2boron]": 311,
      "[:0sulfoxime_cis]": 312,
      "[=Branch]": 313,
      "[:0ammonium2]": 314,
      "[=B]": 315,
      "[:#2sulfilimine_cis]": 316,
      "[/Br]": 317,
      "[:0aziridine_n]": 318,
      "[:0pyrimidine]": 319,
      "[:2boron]": 320,
      "[:1sulfilimine_cis]": 321,
      "[/P]": 322,
      "[:=4benzene]": 323,
      "[:=0oxadiazole]": 324,
      "[:2dithiole]": 325,
      "[:=0phosphine6]": 326,
      "[Ring2]": 327,
      "[:0sulfilimine_cis]": 328,
      "[=N]": 329,
      "[:#1sulfoxime_trans]": 330,
      "[:=0furan]": 331,
      "[:=0phosphine7]": 332,
      "[:0cyclobutane]": 333,
      "[:#1chiral2]": 334,
      "[:2chiral]": 335,
      "[/Ring3]": 336,
      "[:0tetrahydrofuran]": 337,
      "[:3phosphine7]": 338,
      "[/Cl]": 339,
      "[:1diazinane]": 340,
      "[:=2ammonium]": 341,
      "[:#0thiophene]": 342,
      "[:0phosphineoxide]": 343,
      "[:=1pyrazole]": 344,
      "[/C]": 345,
      "[:=0benzene]": 346,
      "[:=0pyrimidine]": 347,
      "[:=0cyclohexane]": 348,
      "[:=0chiralc13]": 349,
      "[P]": 350,
      "[=P]": 351,
      "[:0pyrrolidine]": 352,
      "[:=0thiophene]": 353,
      "[:0oxadiazole]": 354,
      "[:#1sulfox_general]": 355,
      "[/S]": 356,
      "[:#0furan]": 357,
      "[:=0imidazoline]": 358,
      "[:#2phosphine7]": 359,
      "[=Cl]": 360,
      "[:#1bridged_n]": 361,
      "[:#0dithiole]": 362,
      "[:0triazole1]": 363,
      "[:2tetrahydrofuran]": 364,
      "[:=1oxadiazole]": 365,
      "[:=2sulfox_general]": 366,
      "[Ring3]": 367,
      "[:=0bridged_n]": 368,
      "[B]": 369,
      "[:0cyclopentane]": 370,
      "[:0chiral2c13]": 371,
      "[:3pyrazole]": 372,
      "[:0sulfoxime_trans]": 373,
      "[:=1sulfonium]": 374,
      "[:1phosphine4]": 375,
      "[:#0pyrazole]": 376,
      "[:#0tetrazole]": 377,
      "[:1chiralc13]": 378,
      "[:#0triazinane]": 379,
      "[:=1ammonium]": 380,
      "[:3tetrahydrofuran]": 381,
      "[:=1phosphine6]": 382,
      "[:1ammonium2]": 383,
      "[=F]": 384,
      "[:1pyrimidine]": 385,
      "[:=1chiral2c13]": 386,
      "[:=1sulfan_general]": 387,
      "[:=2sulfilimine_trans]": 388,
      "[:1sulfox_general]": 389,
      "[:#0aziridine_n]": 390,
      "[:=2phosphine7]": 391,
      "[:#0cyclohexane]": 392,
      "[:#2aziridine_n]": 393,
      "[:1dithiole]": 394,
      "[:#1sulfoxime_cis]": 395,
      "[:#0carboxylate]": 396,
      "[:4pyrrolidine]": 397,
      "[:#3chiral2c13]": 398,
      "[:#1sulfan_general]": 399,
      "[:#2phosphine6]": 400,
      "[:2aziridine_n]": 401,
      "[:#2chiral2c13]": 402,
      "[:#0piperidine]": 403,
      "[:#2cyclohexane]": 404,
      "[:1aziridine_n]": 405,
      "[:#2phosphine2]": 406,
      "[:#1pyrrole]": 407,
      "[:#5benzene]": 408,
      "[:#0phosphine5]": 409,
      "[:1phosphine]": 410,
      "[:=2sulfan_general]": 411,
      "[:1sulfonium]": 412,
      "[:2cyclopropane]": 413,
      "[:#1dithiole]": 414,
      "[:1chiral]": 415,
      "[#I]": 416,
      "[:=2pyrazole]": 417,
      "[:=0phosphine5]": 418,
      "[:=1phosphine5]": 419,
      "[:#2dithiole]": 420,
      "[:#1phosphine3]": 421,
      "[:=2chiral]": 422,
      "[:=0pyrrolidine]": 423,
      "[F]": 424,
      "[:=3boron]": 425,
      "[:=0pyrazole]": 426,
      "[:1sulfoxime_trans]": 427,
      "[#S]": 428,
      "[:0boron]": 429,
      "[:0piperidine]": 430,
      "[:#0cyclopropane]": 431,
      "[:2phosphine7]": 432,
      "[:1pyrrole]": 433,
      "[:=1chiralc13]": 434,
      "[:#1pyrimidine]": 435,
      "[:3cyclobutane]": 436,
      "[:#0sulfonium]": 437,
      "[:2cyclobutane]": 438,
      "[:=1furan]": 439,
      "[:=1pyrazine]": 440,
      "[:2pyrrolidine]": 441,
      "[:1cyclobutane]": 442,
      "[:=2cyclohexane]": 443,
      "[:=1cyclopentane]": 444,
      "[:1cyclopentadiene]": 445,
      "[:#1triazole1]": 446,
      "[:#0pyrrole]": 447,
      "[#Ring3]": 448,
      "[:=3benzene]": 449,
      "[:#0sulfilimine_cis]": 450,
      "[:1phosphine5]": 451,
      "[:=5cyclohexane]": 452,
      "[/Ring2]": 453,
      "[:3ammonium]": 454,
      "[:#1aziridine_n]": 455,
      "[:=2sulfoxime_trans]": 456,
      "[:=4cyclohexane]": 457,
      "[:#1sulfilimine_trans]": 458,
      "[#O]": 459,
      "[:#1benzene]": 460,
      "[:#2sulfox_general]": 461,
      "[\\P]": 462,
      "[:=4cyclopentane]": 463,
      "[:4benzene]": 464,
      "[Branch]": 465,
      "[\\F]": 466,
      "[:1tetrahydrofuran]": 467,
      "[:#3cyclobutane]": 468,
      "[->]": 469,
      "[:1furan]": 470,
      "[:=0tetrazine]": 471,
      "[:=1ammonium2]": 472,
      "[:0ammonium]": 473,
      "[\\N]": 474,
      "[:=1thiophene]": 475,
      "[:1tetrazole]": 476,
      "[:#0pyrrolidine]": 477,
      "[:1phosphine6]": 478,
      "[:=0pyrrole]": 479,
      "[\\I]": 480,
      "[:=2chiralc13]": 481,
      "[:#1cyclohexane]": 482,
      "[:=1phosphine3]": 483,
      "[:=0chiral]": 484,
      "[=Br]": 485,
      "[:#0phosphine7]": 486,
      "[:=2dithiole]": 487,
      "[:4cyclopentane]": 488,
      "[:=1sulfox_general]": 489,
      "[:#1chiralc13]": 490,
      "[:#3chiral2]": 491,
      "[:#1phosphine4]": 492,
      "[:=2cyclopentane]": 493,
      "[:#1pyrrolidine]": 494,
      "[:3boron]": 495,
      "[=S]": 496,
      "[:#1ammonium2]": 497,
      "[:#0pyrazine]": 498,
      "[:#0sulfox_general]": 499,
      "[:2sulfoxime_trans]": 500,
      "[:=1aziridine_n]": 501,
      "[:#2tetrahydrofuran]": 502,
      "[:=1phosphine]": 503,
      "[:#1triazinane]": 504,
      "[:=3chiral2c13]": 505,
      "[:=0chiral2c13]": 506,
      "[:1boron]": 507,
      "[:=1triazole1]": 508
    }
  }
}